Repository: Segilmez06/tym
Catalog: src/Properties/Messages.*.resx
Languages: tr

# Args.FilePath
source: Path to the image file. Also supports web links. (DANGER: USE WEB LINKS AT YOUR OWN RISK!)
tr: Resim dosyasının konumu. Ağ bağlantıları da desteklenmektedir. (HARİCİ BAĞLANTILARI KULLANIRKEN DİKKATLİ OLUN!)

# Args.Height
source: Output height as pixels. 1 char height = 2 pixels. Set to 0 for auto size.
tr: Pixel cinsinden çıktının yüksekliği. 1 karakter yüksekliği = 2 pixel. Otomatik boyutlandırma için 0'a ayarlayın.

# Args.ListResamplers
source: List available resampling algorithms.
tr: Ölçeklendirme algoritmalarını listele.

# Args.MarginX
source: Left margin size as characters. Shifts the output from cursor start to right by specified character count. 1 char width = 1 pixel.
tr: Karakter cinsinden sol kenara olan uzaklık. Çıktıyı imleç konumundan belirtilen karakter sayısı kadar sağa kaydırır. 1 karakter genişliği = 1 pixel.

# Args.MarginY
source: Top margin size as characters. Shifts the output from cursor start to bottom by specified character count. 1 char height = 2 pixels.
tr: Karakter cinsinden üst kenara olan uzaklık. Çıktıyı imleç konumundan belirtilen karakter sayısı kadar aşağı kaydırır. 1 karakter genişliği = 2 pixel.

# Args.ResamplerName
source: Resampling algorithm for downsizing.
tr: Kullanılan ölçeklendirme algoritması.

# Args.ResizeMethod
source: Resizing mode. Available options: Contain, Cover (Crop), Stretch
tr: Boyutlandırma modu: Kullanılabilecek seçenekler: Contain, Cover (Crop), Stretch

# Args.UseFullscreen
source: Use fullscreen. This overrides margin and size arguments!
tr: Tam ekran modu. Bu, boyut ve konum argümanlarını devre dışı bırakır.

# Args.Width
source: Output width as pixels. 1 char width = 1 pixel. Set to 0 for auto size.
tr: Pixel cinsinden çıktının genişliği. 1 karakter genişliği = 1 pixel. Otomatik boyutlandırma için 0'a ayarlayın.

# Error.FileError
source: Failed to open the specified file!
tr: Belirtilen dosya açılamadı!

# Error.InvalidMimeType
source: Server returned invalid mime type "%s"!
tr: Sunucu geçersiz MIME türü ile yanıtladı: "%s"!

# Error.InvalidResampler
source: Invalid resampler specified!
tr: Geçersiz ölçeklendirme algoritması belirtildi!

# Error.InvalidResizeMode
source: Invalid resize mode specified!
tr: Geçersiz boyutlandırma modu belirtildi!

# Error.ResamplerError
source: Failed to fetch resampler!
tr: Ölçeklendirici getirilemedi!

# Error.ResponseCode
source: Server returned code %s!
tr: Sunucu %s kodu gönderd!

# Error.UnsupportedProtocol
source: Only HTTPS protocol is supported!
tr: Sadece HTTPS protokolü desteklenmektedir!

# Error.URLParseError
source: Failed to parse the specified URL!
tr: Belitrilen URL ayrıştırılamadı!

# LogCategory.Error
source: ERROR
tr: HATA

# LogCategory.Info
source: INFO
tr: BILGI

# LogCategory.Warning
source: WARNING
tr: UYARI

# Message.AvailableResamplers
source: Available resampling algorithms:
tr: Kullanılabilecek ölçeklendirme algoritmaları:
